# RT-DETR with DenseNet121 backbone (final verified by output shapes)
nc: 13  # your number of classes
depth_multiple: 1.0
width_multiple: 1.0

backbone:
  # [from, repeats, module, args]
  - [-1, 1, TorchVision, [1024, densenet121, DEFAULT, True, 2, True]]

  # Correct feature taps
  - [0, 1, Index, [256, 5]]   # P3: (1, 256, 160, 160)
  - [0, 1, Index, [512, 7]]   # P4: (1, 512, 80, 80)
  - [0, 1, Index, [1024, 9]]  # P5: (1, 1024, 40, 40)
  # Optional: [0, 1, Index, [1024, 11]]  # P6 (1, 1024, 20, 20)

head:
  # Start from P5 (1024 → 256)
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [-1, 1, AIFI, [256, 8]]
  - [-1, 1, Conv, [256, 1, 1]]

  # Upsample and fuse with P4 (512)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [2, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]]
  - [-1, 1, Conv, [256, 1, 1]]

  # Upsample and fuse with P3 (256)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [1, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]]

  # PAN bottom-up
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]]

  # Final detection transformer decoder
  - [[15, 18, 21], 1, RTDETRDecoder, [nc]]
