# RT-DETR with EfficientNet-B0 backbone

nc: 6  # number of classes


scales:
  l: [1.00, 1.00, 1024]  # depth, width, max_channels

backbone:
  # Layer 0: Load EfficientNet-B0 via TorchVision
  - [-1, 1, TorchVision, [1280, "efficientnet_b0", "DEFAULT", True]]  # backbone index 0
  
  # Extract P3 features (1/8 scale)
  - [0, 1, nn.AdaptiveAvgPool2d, [[40, 40]]]  # Force consistent spatial dimensions → backbone index 1
  - [-1, 1, Conv, [512, 1, 1]]  # Project to 512 channels → backbone index 2
  
  # Extract P4 features (1/16 scale)
  - [0, 1, nn.AdaptiveAvgPool2d, [[20, 20]]]  # Force consistent spatial dimensions → backbone index 3
  - [-1, 1, Conv, [1024, 1, 1]]  # Project to 1024 channels → backbone index 4
  
  # Extract P5 features (1/32 scale)
  - [0, 1, nn.AdaptiveAvgPool2d, [[10, 10]]]  # Force consistent spatial dimensions → backbone index 5
  - [-1, 1, Conv, [2048, 1, 1]]  # Project to 2048 channels → backbone index 6

head:
  # Process P5 features
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # input_proj.2 → head index 7
  - [-1, 1, AIFI, [1024, 8]]  # head index 8
  - [-1, 1, Conv, [256, 1, 1]]  # Y5, lateral_convs.0 → head index 9

  # Upsample P5 and combine with P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # head index 10
  - [4, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # input_proj.1 → head index 11
  - [[-2, -1], 1, Concat, [1]]  # head index 12
  - [-1, 3, RepC3, [256]]  # fpn_blocks.0 → head index 13
  - [-1, 1, Conv, [256, 1, 1]]  # Y4, lateral_convs.1 → head index 14

  # Upsample P4 and combine with P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # head index 15
  - [2, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # input_proj.0 → head index 16
  - [[-2, -1], 1, Concat, [1]]  # cat backbone P3 → head index 17
  - [-1, 3, RepC3, [256]]  # X3, fpn_blocks.1 → head index 18

  # Downsample P3 and combine with processed P4
  - [-1, 1, Conv, [256, 3, 2]]  # downsample_convs.0 → head index 19
  - [[-1, 14], 1, Concat, [1]]  # cat Y4 → head index 20
  - [-1, 3, RepC3, [256]]  # F4, pan_blocks.0 → head index 21

  # Downsample P4 and combine with processed P5
  - [-1, 1, Conv, [256, 3, 2]]  # downsample_convs.1 → head index 22
  - [[-1, 9], 1, Concat, [1]]  # cat Y5 → head index 23
  - [-1, 3, RepC3, [256]]  # F5, pan_blocks.1 → head index 24

  # RT-DETR Decoder
  - [[18, 21, 24], 1, RTDETRDecoder, [nc]]  # Detect(P3, P4, P5) → head index 25